{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "07db002a-dcbf-4325-9c3c-457ca364141d",
   "metadata": {},
   "source": [
    "# Поиск подстроки\n",
    "\n",
    "Марсоход должен исследовать странные каменные структуры: на поверхности скал обнаружена последовательность символов. Предположительно, эту последовательность создали разумные существа. Учёные предполагают, что эта последовательность содержит некие коды или тексты.\n",
    "\n",
    "Для расшифровки необходимо выявить в последовательности самую длинную подстроку, состоящую из уникальных символов: наибольший ряд символов, в котором каждый символ встречается только один раз. Это поможет найти ключ к разгадке послания или просто даст понять, случайны ли эти символы, или в них есть порядок.\n",
    "\n",
    "Напишите программу, которая принимает на вход строку и находит в ней наибольшую длину подстроки, в которой нет повторяющихся символов. Программа должна вернуть натуральное число — длину этой подстроки.\n",
    "\n",
    "Используйте метод скользящего окна для решения задачи. Если в строке встретится дубликат, запомните длину получившейся подстроки и начинайте строить окно заново.\n",
    "\n",
    "Формат ввода\n",
    "Одна строка, состоящая из строчных латинских букв. Длина строки не превосходит 10 000 символов.\n",
    "\n",
    "Формат вывода\n",
    "Натуральное число — длина наибольшей подстроки с уникальными символами.\n",
    "\n",
    "### Формат ввода\n",
    "Одна строка, состоящая из строчных латинских букв. Длина строки не превосходит 10 000 символов.\n",
    "\n",
    "### Формат вывода\n",
    "Натуральное число — длина наибольшей подстроки с уникальными символами."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e3213177-73ac-47fc-beb8-137c77fdf71a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "def find_biggest(data):\n",
    "    unique_chars = set()\n",
    "    max_length = 0\n",
    "    start = 0\n",
    "\n",
    "    for n in range(len(data)):\n",
    "        while data[n] in unique_chars:\n",
    "            unique_chars.remove(data[start])\n",
    "            start += 1\n",
    "        unique_chars.add(data[n])\n",
    "        max_length = max(max_length, n - start + 1)\n",
    "    return max_length\n",
    "\n",
    "input_data = 'abcabcbb'\n",
    "print(find_biggest(input_data))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
