{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "92340ff4-1280-4b9a-b319-54bd03025381",
   "metadata": {},
   "source": [
    "# Количество чисел, меньших, чем заданное\n",
    "\n",
    "Марсоход раз в час записывает в массив информацию о солнечной радиации. Каждое значение — это число от 0 до 100.\n",
    "\n",
    "Для каждого элемента требуется определить, сколько в массиве есть значений меньше, чем текущее. Результат нужно записать во второй массив.\n",
    "\n",
    "Исходные массивы могут быть длиной от 2 до 500 элементов.\n",
    "\n",
    "Например, исходный массив — nums = [8, 1, 2, 2, 3].\n",
    "\n",
    "Берём первое значение массива, это 8. Сравниваем это число с остальными: считаем, сколько в массиве есть чисел, меньших, чем выбранное. В этом массиве четыре числа, меньших, чем 8. Создаём массив result, записываем в него 4.\n",
    "\n",
    "Точно так же проверяем второе значение в исходном массиве, это единица. В исходном массиве нет ни одного числа, меньшего, чем 1. В массив result записываем второе значение: 0.\n",
    "\n",
    "Проверяем третье значение в массиве nums, это 2. Есть только одно значение, меньшее, чем 2. В массив result записываем третье значение — 1.\n",
    "\n",
    "Таким же образом проверяем все остальные значения в nums.\n",
    "\n",
    "В итоге для входного массива [8, 1, 2, 2, 3] получится результирующий массив [4, 0, 1, 1, 3].\n",
    "\n",
    "### Формат ввода\n",
    "Массив целых чисел, записанных через пробел, — показатели радиации.\n",
    "\n",
    "### Формат вывода\n",
    "Массив целых чисел, записанных через пробел, где каждое число — это количество чисел в исходном массиве, меньших, чем рассматриваемое."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "0e3c5802-4525-4c10-a2b7-e377245e7d0c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 0 1 1 3\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "\n",
    "\n",
    "def count_smaller_elements(data):\n",
    "    result = []\n",
    "    for element in data:\n",
    "        counter = 0\n",
    "        for second_element in data:\n",
    "            if second_element < element:\n",
    "                counter += 1\n",
    "        result.append(counter)\n",
    "    return print(*result, sep=' ')\n",
    "\n",
    "\n",
    "input_list = [8, 1, 2, 2, 3]\n",
    "count_smaller_elements(input_list)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
